kAMDSuccess = "Возникла ошибка.";
kAMDUndefinedError = "Произошла неожиданная ошибка.";
kAMDBadHeaderError = "Не удалось перенести файл.";
kAMDNoResourcesError = "Не удалось выделить ресурс.";
kAMDReadError = "Не удалось прочитать с устройства.";
kAMDWriteError = "Не удалось произвести запись на устройство.";
kAMDUnknownPacketError = "Пакет неизвестен.";
kAMDInvalidArgumentError = "Аргумент недействителен.";
kAMDNotFoundError = "Не удалось найти файл.";
kAMDIsDirectoryError = "Путь является каталогом.";
kAMDPermissionError = "У Вас нет прав доступа.";
kAMDNotConnectedError = "Нет подключения к устройству.";
kAMDTimeOutError = "Время на выполнение операции истекло.";
kAMDOverrunError = "Произошла перегрузка буфера.";
kAMDEOFError = "Конец файла.";
kAMDUnsupportedError = "Эта операция не поддерживается.";
kAMDFileExistsError = "Файл уже существует.";
kAMDBusyError = "Устройство занято.";
kAMDCryptoError = "Не удалось установить безопасное подключение к устройству.";
kAMDTooBigError = "Сообщение слишком длинное.";
kAMDInvalidResponseError = "Получен неожиданный ответ из устройства.";
kAMDMissingKeyError = "Ключ отсутствует.";
kAMDMissingValueError = "Значение отсутствует.";
kAMDGetProhibitedError = "Не удалось извлечь значение из защищенного код-паролем устройства.";
kAMDSetProhibitedError = "Не удается установить значение на устройстве.";
kAMDRemoveProhibitedError = "Не удается удалить значение на устройстве.";
kAMDImmutableValueError = "Значение не может быть изменено.";
kAMDPasswordProtectedError = "Устройство защищено код-паролем.";
kAMDMissingHostIDError = "Устройство не распознает хост.";
kAMDInvalidHostIDError = "Устройство не распознает хост.";
kAMDSessionActiveError = "Сеанс активен.";
kAMDSessionInactiveError = "Сеанс неактивен.";
kAMDMissingSessionIDError = "Идентификатор сеанса отсутствует.";
kAMDInvalidSessionIDError = "Идентификатор сеанса недействителен.";
kAMDMissingServiceError = "Служба отсутствует.";
kAMDInvalidServiceError = "Служба недействительна.";
kAMDServiceLimitError = "Запущено слишком много элементов этой службы.";
kAMDCheckinSetupFailedError = "Не удалось запустить службу на устройстве";
kAMDInvalidCheckinError = "Не удалось запустить службу на устройстве";
kAMDCheckinTimeoutError = "Служба на этом устройстве не была запущена надлежащим образом.";
kAMDCheckinConnectionFailedError = "Служба на этом устройстве не была запущена надлежащим образом.";
kAMDCheckinReceiveFailedError = "Служба на этом устройстве не была запущена надлежащим образом.";
kAMDCheckinResponseFailedError = "Служба на этом устройстве не была запущена надлежащим образом.";
kAMDCheckinOutOfMemoryError = "Служба на этом устройстве не была запущена надлежащим образом.";
kAMDCheckinSendFailedError = "Служба на этом устройстве не была запущена надлежащим образом.";
kAMDMissingPairRecordError = "Парное соединение хоста с устройством не создано.";
kAMDInvalidPairRecordError = "Парное соединение хоста с устройством больше не существует.";
kAMDSavePairRecordFailedError = "Не удалось сохранить запись создания пары.";
kAMDInvalidActivationRecordError = "Неверная запись активации.";
kAMDMissingActivationRecordError = "Не удалось найти запись активации.";
kAMDServiceProhibitedError = "Службу на этом устройстве запустить не удалось.";
kAMDEscrowLockedError = "Устройство недоступно до первого разблокирования после загрузки.";
kAMDProhibitedBySupervision = "Операция запрещена на сопровождаемых устройствах.";
kAMDPairingProhibitedError = "Создать пару можно только по USB.";
kAMDWrongDroidError = "Устройство находится в режиме восстановления.";
kAMDSUVerificationError = "Не удалось проверить пакет обновления ПО.";
kAMDSUPatchError = "Не удалось дополнить файл.";
kAMDSUFirmwareError = "Не удалось обновить прошивку.";
kAMDProvisioningProfileNotValid = "Профиль обеспечения неверен.";
kAMDSendMessageError = "Не удалось отправить сообщение на устройство.";
kAMDReceiveMessageError = "Не удалось получить сообщение с устройства.";
kAMDMissingOptionsError = "Параметры отсутствуют.";
kAMDMissingImageTypeError = "Образ отсутствует.";
kAMDDigestFailedError = "Не удалось прочитать образ диска.";
kAMDStartServiceError = "Службу запустить не удалось.";
kAMDInvalidDiskImageError = "Образ диска недействителен.";
kAMDMissingDigestError = "Digest отсутствует.";
kAMDMuxError = "Произошла ошибка с мультиплексором устройства USB.";
kAMDApplicationAlreadyInstalledError = "Системная программа с данным идентификатором пакета уже установлена на этом устройстве и не может быть заменена.";
kAMDApplicationMoveFailedError = "Программу не удалось переместить в место на устройстве.";
//kAMDApplicationSINFCaptureFailedError = "";
kAMDApplicationSandboxFailedError = "Не удалось создать песочницу для программы.";
kAMDApplicationVerificationFailedError = "Программу не удалось проверить.";
kAMDArchiveDestructionFailedError = "Не удалось удалить архив программы.";
kAMDBundleVerificationFailedError = "Не удалось проверить пакет оператора.";
kAMDCarrierBundleCopyFailedError = "Не удалось установить пакета оператора.";
kAMDCarrierBundleDirectoryCreationFailedError = "Не удалось создать каталог пакета оператора.";
kAMDCarrierBundleMissingSupportedSIMsError = "Нет поддерживаемых SIM-карт для этого пакета оператора.";
kAMDCommCenterNotificationFailedError = "Не удалось прослушать уведомление группового тракта (baseband).";
kAMDContainerCreationFailedError = "Не удалось создать контейнер программы.";
kAMDContainerP0wnFailedError = "Не удалось восстановить права доступа к контейнеру программы.";
kAMDContainerRemovalFailedError = "Не удалось удалить контейнер программы.";
kAMDEmbeddedProfileInstallFailedError = "Не удалось установить встроенные профили обеспечения.";
kAMDErrorError = "Произошла ошибка.";
kAMDExecutableTwiddleFailedError = "Не удалось изменить исполняемые права доступа к программе.";
kAMDExistenceCheckFailedError = "Не удалось проверить, существует ли уже эта программа.";
kAMDInstallMapUpdateFailedError = "Не удалось обновить список установленных программ.";
kAMDManifestCaptureFailedError = "Не удалось сохранить манифест контейнера.";
kAMDMapGenerationFailedError = "Не удалось создать список программ.";
kAMDMissingBundleExecutableError = "Пакет программ не содержит действительный выполняемый модуль.";
kAMDMissingBundleIdentifierError = "Пакет программ не содержит действительный идентификатор.";
kAMDMissingBundlePathError = "Не удалось определить путь пакета программ.";
kAMDMissingContainerError = "Не удалось найти контейнер для установленной программы.";
kAMDNotificationFailedError = "Не удалось разместить уведомление.";
kAMDPackageExtractionFailedError = "Не удалось открыть пакет программы.";
kAMDPackageInspectionFailedError = "Не удалось проверить пакет программы.";
kAMDPackageMoveFailedError = "Не удалось переместить пакет программы в место временного размещения.";
kAMDPathConversionFailedError = "Не удалось преобразовать путь.";
kAMDRestoreContainerFailedError = "Не удалось восстановить контейнер программы.";
kAMDSeatbeltProfileRemovalFailedError = "Не удалось удалить надежный профиль.";
kAMDStageCreationFailedError = "Не удалось создать временный каталог.";
kAMDSymlinkFailedError = "Не удалось создать символьную ссылку.";
kAMDiTunesArtworkCaptureFailedError = "Не удалось сохранить обложку iTunes.";
kAMDiTunesMetadataCaptureFailedError = "Не удалось сохранить метаданные iTunes.";
kAMDAlreadyArchivedError = "Программа уже заархивирована.";
kAMDUnknownCommandError = "Устройство не распознает команду.";
kAMDAPIInternalError = "Произошла внутренняя ошибка API.";
kAMDMuxCreateListenerError = "Не удалось прослушать устройства USB.";
kAMDMuxGetListenerError = "Не удалось найти USB-слушателя.";
kAMDMuxConnectError = "Не удалось подключиться к устройству.";
kAMDDeviceTooNewError = "Необходимо обновить эту программу.";
kAMDDeviceRefNoGood = "Это устройство больше не подключено.";
kAMDDeviceDisconnectedError = "Это устройство больше не подключено.";
kAMDCannotTranslateError = "Не удалось перевести сообщения с устройства";
kAMDMobileImageMounterMissingImageSignature = "Не удалось поддержать разработку.";
kAMDMobileImageMounterResponseCreationFailed = "Не удалось поддержать разработку.";
kAMDMobileImageMounterMissingImageType = "Не удалось поддержать разработку.";
kAMDMobileImageMounterMissingImagePath = "Не удалось поддержать разработку.";
kAMDMobileImageMounterImageMapLoadFailed = "Не удалось поддержать разработку.";
kAMDMobileImageMounterAlreadyMounted = "Не удалось поддержать разработку.";
kAMDMobileImageMounterImageMoveFailed = "Не удалось поддержать разработку.";
kAMDMobileImageMounterMountPathMissing = "Не удалось поддержать разработку.";
kAMDMobileImageMounterMountPathNotEmpty = "Не удалось поддержать разработку.";
kAMDMobileImageMounterImageMountFailed = "Не удалось поддержать разработку.";
kAMDMobileImageMounterTrustCacheLoadFailed = "Не удалось поддержать разработку.";
kAMDMobileImageMounterDigestFailed = "Не удалось поддержать разработку.";
kAMDMobileImageMounterDigestCreationFailed = "Не удалось поддержать разработку.";
kAMDMobileImageMounterImageVerificationFailed = "Не удалось поддержать разработку.";
kAMDMobileImageMounterImageInfoCreationFailed = "Не удалось поддержать разработку.";
kAMDMobileImageMounterImageMapStoreFailed = "Не удалось поддержать разработку.";
kAMDDeviceOSVersionTooLow = "Версия ОС устройства слишком стара.";
kAMDNoWifiSyncSupportError = "Устройство не поддерживает беспроводную синхронизацию.";
kAMDDeviceFamilyNotSupported = "Эта программа не поддерживает данный тип устройства.";
kAMDPackagePatchFailedError = "Не удалось применить обновление-вставку к программе.";
kAMDIncorrectArchitectureError = "Эта программа поддерживает данный тип ЦПУ устройства.";
kAMDPluginCopyFailedError = "Не удалось скопировать VPN-плагин в контейнер программы.";
kAMDBreadcrumbFailedError = "Не удалось записать установку навигатора.";
kAMDBreadcrumbUnlockError = "Не удалось обновить установку навигатора.";
kAMDGeoJSONCaptureFailedError = "Не удалось сохранить данные GeoJSON.";
kAMDNewsstandArtworkCaptureFailedError = "Не удалось сохранить обложку Киоска.";
kAMDMissingCommandError = "В запросе отсутствовала команда.";
kAMDNotEntitledError = "Запрашиваемой программе не разрешено выполнять этот запрос.";
kAMDMissingPackagePathError = "В запросе отсутствовал путь к пакету.";
kAMDMissingContainerPathError = "В запросе отсутствовал путь к контейнеру.";
kAMDMissingApplicationIdentifierError = "В запросе отсутствовал идентификатор программы.";
kAMDMissingAttributeValueError = "В запросе отсутствовало требуемое значение.";
kAMDLookupFailedError = "Не удалось создать список установленных программ.";
kAMDDictCreationFailedError = "Не удалось извлечь возможности из запроса.";

/* kMISFileError */
"A file operation failed." = "Сбой при обработке файла.";

/* kMISModifiedResourcesError */
"A signed resource has been added, modified, or deleted." = "Подписанный ресурс добавлен, изменен или удален.";

/* kMISInvalidSignerError */
"A valid provisioning profile for this executable was not found." = "Действительный профиль обеспечения для выполняемой программы не был найден.";

/* kMISUnknownError */
"An unknown error has occurred." = "Произошла неопознанная ошибка.";

/* kMISNotMutableError */
"Attempted to modify an immutable provisioning profile." = "Попытка изменить неизменяемый профиль обеспечения.";

/* kMISApplicationSignatureNotValidError */
"The application does not have a valid signature." = "Программа не имеет действительной подписи.";

/* kMISApplicationSignatureNotValidError */
"The application's signature is valid but it does not match the expected hash." = "Подпись программы действительна, но не совпадает с ожидаемым хешем.";

/* kMISAdHocSignatureError */
"The executable contains an invalid signature." = "Выполняемая программа содержит недействительную подпись.";

/* kMISInvalidEntitlementError */
"The executable was signed with invalid entitlements." = "Выполняемая программа была подписана без наличия действительных прав.";

/* kMISInvalidSignerCertError */
"The identity used to sign the executable is no longer valid." = "Удостоверение, использованное для подписи выполняемой программы, больше не действительно.";

/* kMISSignatureNotValidError */
"The signature was not valid." = "Подпись была недействительна.";

/* kMISConnectionClosedError */
"There was an error communicating with your device." = "Произошла ошибка при обмене данными с устройством.";

/* kMISUnsupportedDeviceError */
"This provisioning profile cannot be installed on this device." = "Профиль обеспечения не может быть установлен на этом устройстве.";

/* kMISProfileSignatureNotValidError */
"This provisioning profile does not have a valid signature (or it has a valid, but untrusted signature)." = "Профиль обеспечения не имеет действительной подписи (или она действительна, но ненадежна).";

/* kMISExpiredError */
"This provisioning profile has expired." = "Срок действия профиля обеспечения истек.";

/* kMISMalformedProfileError */
"This provisioning profile is malformed." = "Профиль обеспечения деформирован.";

/* kMISUnsupportedVersionError */
"This provisioning profile is unsupported." = "Профиль обеспечения не поддерживается.";

/* kMISAllocationError */
"Unable to allocate memory." = "Не удается выделить память.";

